clear all
clc

% x = [0, 0.1 0.2 0.3 0.4, 0.5 0.6 0.7 0.8, 0.9]; % , veya boşluk kullanılabilir.
% y = 10*x+1    % x vek. yararlanarak y vektörü oluşturuldu

% A = 2:0.3:3.8  
% B = 1:-0.2:-0.4
% C = [2:0.3:3.8]'

% A = [2.0 2.3 2.6 2.9 3.2 3.5 3.8];
% B = A(3:1:6)
% C = A(2:2:6)
% D = A(5:-1:2)

% F = [0 0.3 0.6 0.9 1.2 1.5 1.8 2.1 2.4 2.7];
% G = F(1:6)
% H = F(5:end)
% F(5:1)

% A = [1 3 5 7 9 11 13 15 17 19 21];
% K = A([3 8 1 9])

% X = [1 2 8 6 -1]
% Y = [11 X]
% Y(2) = -1.4;
% Y(7) = 99;
% Y(9) = 98;
% Y
% E = (0:4:20)*3

M = linspace(0,pi,100)
N = logspace(1,4,5)
P = logspace(1,7,3)